openfoam/arc/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.001;

vertices
(
    // Axial extent: x = -800 mm (-1L upstream of the nose) to 5600 mm
    // (+6L behind the 800 mm body base, with L = 10D and D = 80 mm)
    // Cylindrical farfield radius: 600 mm = 7.5D (15D diameter)
    // O-grid core half-width: 300 mm = 3.75D
    // Circular boundary diagonal intercept: 600 / sqrt(2) = 424.264 mm

    // inlet plane (x = -800 mm)
    (-800 -300.000 -300.000)  // 0  inner SW
    (-800  300.000 -300.000)  // 1  inner SE
    (-800  300.000  300.000)  // 2  inner NE
    (-800 -300.000  300.000)  // 3  inner NW
    (-800 -424.264 -424.264)  // 4  outer SW
    (-800  424.264 -424.264)  // 5  outer SE
    (-800  424.264  424.264)  // 6  outer NE
    (-800 -424.264  424.264)  // 7  outer NW

    // outlet plane (x = 5600 mm)
    (5600 -300.000 -300.000)  // 8  inner SW
    (5600  300.000 -300.000)  // 9  inner SE
    (5600  300.000  300.000)  // 10 inner NE
    (5600 -300.000  300.000)  // 11 inner NW
    (5600 -424.264 -424.264)  // 12 outer SW
    (5600  424.264 -424.264)  // 13 outer SE
    (5600  424.264  424.264)  // 14 outer NE
    (5600 -424.264  424.264)  // 15 outer NW
);

blocks
(
    hex (0 8 9 1 3 11 10 2)
    (480 20 20)
    simpleGrading (1 1 1)

    hex (4 12 13 5 0 8 9 1)
    (480 20 10)
    simpleGrading (1 1 1)

    hex (1 9 13 5 2 10 14 6)
    (480 10 20)
    simpleGrading (1 1 1)

    hex (3 11 10 2 7 15 14 6)
    (480 20 10)
    simpleGrading (1 1 1)

    hex (4 12 8 0 7 15 11 3)
    (480 10 20)
    simpleGrading (1 1 1)
);

edges
(
    arc 7 6   (-800   0.000  600.000)
    arc 6 5   (-800 600.000    0.000)
    arc 4 5   (-800   0.000 -600.000)
    arc 4 7   (-800 -600.000    0.000)

    arc 15 14 (5600   0.000  600.000)
    arc 14 13 (5600 600.000    0.000)
    arc 12 13 (5600   0.000 -600.000)
    arc 12 15 (5600 -600.000    0.000)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 2 1)
            (4 0 1 5)
            (1 2 6 5)
            (3 7 6 2)
            (4 7 3 0)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (8 9 10 11)
            (12 13 9 8)
            (9 13 14 10)
            (11 10 14 15)
            (12 8 11 15)
        );
    }
    farfield
    {
        type patch;
        faces
        (
            (7 15 14 6)
            (6 14 13 5)
            (4 5 13 12)
            (4 12 15 7)
        );
    }
);

mergePatchPairs();


// ************************************************************************* //
