openfoam/arc/system/snappyHexMeshDict
FoamFile { version 2.0; format ascii; class dictionary; object snappyHexMeshDict; }

castellatedMesh true;
snap            true;
addLayers       false;

geometry
{
    fuselage.stl
    {
        type triSurfaceMesh;
        scale 0.001;
        name fuselage;
    }
    stabilizers.stl
    {
        type triSurfaceMesh;
        scale 0.001;
        name stabilizers;
    }


    refinementCylinder
    {
        type searchableCylinder;
        point1 (-0.20 0.0 0.0);
        point2 (2.00 0.0 0.0);
        radius 0.36;
    }

    nearBodyCylinder
    {
        type searchableCylinder;
        point1 (-0.10 0.0 0.0);
        point2 (1.20 0.0 0.0);
        radius 0.12;
    }

    aftBaseCylinder
    {
        type searchableCylinder;
        point1 (0.76 0.0 0.0);
        point2 (0.92 0.0 0.0);
        radius 0.065;
    }
};

castellatedMeshControls
{
    maxLocalCells   8500000;
    maxGlobalCells  1000000;
    minRefinementCells 5;
    maxLoadUnbalance 0.10;
    nCellsBetweenLevels 3;
    resolveFeatureAngle 30;

    features
    (
        { file "fuselage.eMesh";    level 5; }
        { file "stabilizers.eMesh"; level 5; }
    );

    refinementSurfaces
    {
        fuselage { level (4 5); }
        stabilizers { level (4 5); }
    }

    refinementRegions
    {
        // Broad refinement from upstream of the nose through 1.5L downstream.
        refinementCylinder
        {
            mode inside;
            levels ((1E15 1));
        }

        // Stronger nested refinement around the body and immediate wake.
        nearBodyCylinder
        {
            mode inside;
            levels ((1E15 2));
        }

        // Local support for the thin fin/body-base junction.
        aftBaseCylinder
        {
            mode inside;
            levels ((1E15 3));
        }
    }

    locationInMesh (0.4 0.1 0.0);  // inside fluid, outside the 40 mm body radius
    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch    3;
    tolerance       2.0;
    nSolveIter      50;
    nRelaxIter      6;
    nFeatureSnapIter 15;
    implicitFeatureSnap false;
    explicitFeatureSnap true;
    multiRegionFeatureSnap false;
}

addLayersControls
{
    relativeSizes false;
    layers
    {
        fuselage    { nSurfaceLayers 22; }
        stabilizers { nSurfaceLayers 22; }
    }
    expansionRatio           1.2;
    firstLayerThickness      7.1e-7;
    minThickness             1e-8;
    nGrow                    0;
    featureAngle             60;
    slipFeatureAngle         30;
    nRelaxIter               5;
    nSmoothSurfaceNormals    3;
    nSmoothNormals           3;
    nSmoothThickness         10;
    maxFaceThicknessRatio    0.5;
    maxThicknessToMedialRatio 0.1;
    nRelaxedIter             5;
}

meshQualityControls
{
    maxNonOrtho          65;
    maxBoundarySkewness  20;
    maxInternalSkewness  4;
    maxConcave           80;
    minFlatness          0.5;
    minVol               1e-15;
    minTetQuality        1e-9;
    minArea              -1;
    minTwist             0.05;
    minDeterminant       0.01;
    minFaceWeight        0.05;
    minVolRatio          0.01;
    minTriangleTwist     -1;
    nSmoothScale         4;
    errorReduction       0.75;

    relaxed
    {
        maxNonOrtho          75;
        maxBoundarySkewness  20;
        maxInternalSkewness  8;
        maxConcave           80;
        minDeterminant       0.0001;
        minFaceWeight        0.02;
    }
}

writeFlags
(
    scalarLevels
);

mergeTolerance 1e-8;
