openfoam/arc/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
#include "../constant/freestreamProperties"
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform $TInf;

boundaryField
{
    "(inlet|outlet|farfield)"
    {
        type            characteristicFarfieldTemperature;
        U               $UInf;
        p               $pInf;
        T               $TInf;
        value           $internalField;
    }
    body
    {
        type            characteristicWallTemperature;
        value           $internalField;
    }
}


// ************************************************************************* //
